# IS362 Project 3
Your assignment involves combining information from a number of SQL tables, then displaying the information in a pandas DataFrame. For your relational database management system, you may use any RDBMS, including MySQL, PostgreSQL, sqlite, or any of the other RDMBSs supported by the database.

##### First, all required modules must be loaded:

In [1]:
import pandas as pd

from sqlalchemy import create_engine

import mysql.connector as msql

##### Now the Chinook database will be connected via the MySQL connector:

In [2]:
db_connection_str = msql.connect(host = 'localhost', database = 'Chinook', user = 'DBuser1', password = 'password', auth_plugin = 'mysql_native_password')

##### Next, the sql query for the required data must be written, and saved in a variable "sql_query":

In [3]:
sql_query = '''SELECT Customer.LastName, Customer.FirstName, Track.Name, Album.Title FROM Customer INNER JOIN Invoice ON Customer.CustomerId = Invoice.CustomerId INNER JOIN InvoiceLine ON Invoice.InvoiceId = InvoiceLine.InvoiceId INNER JOIN Track ON InvoiceLine.TrackId = Track.TrackId INNER JOIN Album ON Track.AlbumId = Album.AlbumId ORDER BY Customer.LastName, Customer.FirstName'''

##### Now the data can be read into a pandas dataframe and displayed:

In [4]:
dframe = pd.read_sql(sql_query, db_connection_str)

dframe.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas